       program-id. CALLPROG as "STARTPROG.CALLPROG".

       environment division.
       configuration section.
       repository.
       

       data division.
       working-storage section.
       01  CALL-PROGRAM         PIC X(20).
          
       procedure division.

 
           goback.
       end program CALLPROG.
