       class-id. Form1 as "STARTPROG.Form1" is partial
                 inherits type "System.Windows.Forms.Form".
                 
       environment division.
       configuration section.
       repository.
      
       object.
       working-storage section.
       
       method-id. NEW.
       procedure division.
           invoke self::"InitializeComponent"
           goback.
       end method NEW.
      
       end object.
       end class Form1.
